/*//==============================================================================================================
Вернуть значение бита в числе N по его номеру K.
Позиции битов нумеруются с 0.

Необходимо использование битовых операций.
Использование арифметических операций запрещено.
 *///==============================================================================================================
#include <iostream>
using namespace std;

int bit_value_by_its_number(unsigned int N, unsigned int K) {
    return (N >> K) & 1; // Номер бита в числе N по его номеру K.
}

int main() {
    unsigned int N, K;
    cin >> N >> K;
    cout << bit_value_by_its_number(N, K);
    return 0;
}
