/*//==============================================================================================================
Если в числе содержится только один бит со значением 1, записать в выходной поток OK.
Иначе записать FAIL.
Необходимо использование битовых операций.
Использование арифметических операций запрещено.
 *///==============================================================================================================
#include <iostream>
using namespace std;

bool is_power_of_two(unsigned int n){
    return (n && !(n & (n - 1)));
}

int main() {
    unsigned int N;
    cin >> N;
    cout << (is_power_of_two(N)? "OK" : "FAIL");
    return 0;
}
